{
    "posts": {
        "post1": {
            "image": "img/blog-img/javascript.jpg",
            "title": "Dynamische Blogeinträge mit JSON und JavaScript",
            "date": "19.09.2023",
            "text": "Anders als man vielleicht denken mag, sind diese Beiträge nicht im HTML-Code hardcodiert. Stattdessen nutze ich eine JSON-Datei, um die Inhalte zu speichern, und greife auf diese Daten mithilfe von JavaScript zu, um sie dann in die entsprechenden DIV-Elemente im HTML-Dokument einzufügen. Warum wähle ich diesen Ansatz? Die Antwort liegt in der Flexibilität und der effizienteren Verwaltung meiner Inhalte. Statt jeden Beitrag manuell im HTML zu bearbeiten, kann ich einfach die JSON-Datei anpassen. Das bedeutet im Prinzip: wesentlich weniger repetitive Arbeit und vorallem Übersicht. <br><br>Die Umsetzung ist eigentlich recht simpel. Ich habe eine JSON-Datei, in der alle Informationen für meine Beiträge gespeichert sind, von Texten über Bilder bis hin zu Verlinkungen. Mithilfe von JavaScript lese ich diese Daten aus der Datei aus und füge sie dynamisch in die entsprechenden Div-Elemente in meinem HTML-Dokument ein. Diese Methode bietet nicht nur eine effiziente Aktualisierung von Inhalten, sondern ermöglicht auch eine bessere Trennung von Inhalt und Darstellung. <br><br>Wenn ihr also diese Seite seht, wisst ihr, dass hier keine mühsame Handcodierung im HTML stattfindet. Stattdessen steckt hinter den Kulissen ein JSON-Datei-basiertes System, das die Erstellung und Verwaltung von Beiträgen erheblich erleichtert. <br><br> Das wäre es auch schon mit dem allerersten Blogeintrag auf dieser Seite. Bis zum nächsten Mal!"
        },
        "post2": {
            "image": "https://miro.medium.com/v2/resize:fit:679/1*vR-c2OlaAJLjK9ue5785rA.gif",
            "title": "Neu auf dieser Seite: Heller und Dunkler Modus",
            "date": "21.09.2023",
            "text": "Ich freue mich, euch mitteilen zu können, dass es auf dieser Seite jetzt eine brandneue Funktion gibt - den Hell- und Dunkelmodus! Ihr könnt ganz einfach zwischen den beiden Modi wechseln, indem ihr auf das Mond- oder Sonnenicon klickt. Aber lasst mich euch erklären, wie das Ganze funktioniert.<br><br> Dahinter steckt einfach JavaScript. Mit Hilfe von Funktionen fügen wir jedem einzelnen Element auf der Seite die CSS-Klasse <em>.dark-mode</em> hinzu, wenn der Dunkelmodus aktiv ist, und entfernen sie, wenn der helle Modus ausgewählt ist. Das bedeutet, dass die Darstellung der Seite dynamisch anpassbar ist, je nachdem, welcher Modus gerade aktiv ist. <br><br> Aber das ist noch nicht alles. Damit ihr nicht jedes Mal, wenn ihr die Seite besucht, den Modus erneut auswählen müsst, verwendet das Skript den localStorage. Dort wird gespeichert, welcher Modus gerade aktiv ist. Das bedeutet, wenn ihr die Seite das nächste Mal aufruft, wird der Modus automatisch so eingestellt, wie ihr ihn zuletzt ausgewählt habt. Das spart Zeit und sorgt dafür, dass eure Einstellungen beibehalten werden. <br><br>Insgesamt macht diese Technologie die Nutzung der Seite noch angenehmer und anpassbarer. Probiert es gleich aus, indem ihr auf das Mond- oder Sonnenicon klickt, und genießt die neue Flexibilität auf meiner Seite!"
        },
        "post3": {
            "image": "https://www.unicorn.dev/wp-content/uploads/2023/01/react.png",
            "title": "Erste Anfänge mit React/Next.js",
            "date": "20.10.2023",
            "text": "Gestern fing ich damit an, mich mit meinem ersten JavaScript Framework auseinanderzusetzen. Ich entschied mich dazu eine allererste Web-Anwendung mithilfe von <strong>React</strong, bzw. <strong>Next.js</strong> zu entwickeln. Auch, wenn es am Anfang etwas Eingewöhnung forderte, so sehe ich deutlich die Vorteile von wiedervewendbaren Komponenten und vorallem der modifizierten JavaScript-Version JSX.<br><br>Die Web-Anwendung hat noch nicht viel. Sie hat bisher lediglich eine Navigationsbar und eine wiederverwendbare Textbox, die je nach Übergabe in die Funktion, eine beliebige Anzahl von Link-Buttons erzeugt. Perfekt für kleine Infoboxen, die zu anderen Teilen der App leiten sollen. Geplant ist für's Erste eine einfache ToDo Aop darin zu basteln. Auch wäre es interessant einen kleinen fiktiven E-Commerce Shop einzubauen, wo man mit einer fiktiven Währung bezahlen könnte.<br><br>Tatsächlich finde ich dieses Framework so praktisch, dass ich sogar überlege, diese Seite nach React zu übertragen, da ich dann die Blog-Funktion etwas dynamischer machen könnte und ich mich auch endlich an eine funktionierende Bildergalerie wagen könnte. Dabei mag ich aber auch eigentlich die Einfachheit dieser Seite hier.<br><br>Möglichkeiten gibt es jedenfalls sehr viele und ich freue mich schon, mehr mit diesem Framework zu arbeiten. Vielleicht wage ich mich dann auch noch irgendwann an Vue.js oder auch Angular. Aber erst einmal heißt es,<br><br>bis zum nächsten Mal!"
        }
    }
}